[
  {
    "Año": 2025,
    "Proyecto": "Gobierno de datos en equipo MIS (100 personas)",
    "Contexto Caso de Uso": "En una organización multinacional, el seguimiento de dedicación de horas del equipo MIS —conformado por cerca de 100 personas— era fragmentado y desarticulado. Cada gerente llevaba su propio control, lo que impedía obtener una visión integral. Se diseñó un sistema desde cero que centralizó la información, estructuró la jerarquía de datos y conectó los niveles operativos con la alta gerencia. Esto se transformó en un pilar estratégico que permitió traducir esfuerzos individuales en datos accionables para la organización.",
    "Problema": "La falta de un gobierno de datos unificado generaba desconexión entre las decisiones estratégicas y la realidad operativa. La inexistencia de una trazabilidad clara sobre la asignación de horas dificultaba la proyección de costos, la identificación de cuellos de botella y la planificación efectiva de recursos.",
    "Herramientas": "[Excel con VBA]: {automatización de procesos y consolidación de formularios}, [Power Query]: {extracción y transformación de datos desde múltiples fuentes}, [Power Pivot con DAX]: {modelado de datos y cálculos avanzados de uso de recursos}, [LLMs]: {asistencia en categorización y estructuración de registros para optimizar la carga analítica}",
    "Habilidades": "Gobierno de datos, estructuración jerárquica, visualización interactiva, análisis de capacidad y eficiencia operativa.",
    "Resultados": "Se logró una visibilidad consolidada de la dedicación del equipo, permitiendo proyectar costos con precisión, mejorar la calidad de los datos y adaptar la información a múltiples audiencias (tecnología, negocio y finanzas)."
  },
  {
    "Año": 2025,
    "Proyecto": "Cumplimiento regulatorio de mercado de capitales (EE.UU.)",
    "Contexto Caso de Uso": "Una nueva directriz del regulador estadounidense exigía que los aplicativos críticos del portafolio tecnológico (foreign exchange, commodities, prime services y collateral management) actualizaran sus parches de seguridad para garantizar la integridad de sus componentes. Se estructuró un proyecto de escala global que coordinó la remediación de aproximadamente 10.000 componentes distribuidos en 14 aplicativos. El seguimiento se hizo con equipos transversales, depurando los hallazgos mediante escaneos y asignando tareas según el tipo de remediación. El enfoque fue preciso, coordinado y colaborativo.",
    "Problema": "La falta de trazabilidad sobre el estado de los componentes tecnológicos, combinada con la presión de cumplimiento regulatorio, ponía en riesgo la operación y reputación del negocio. Era necesario establecer una gobernanza clara y ágil para evitar sanciones, mejorar la postura de ciberseguridad y garantizar la rendición de cuentas.",
    "Herramientas": "[Power BI]: {visualización de avances y hallazgos en tiempo real para equipos locales y globales}, [Excel]: {control histórico de remediaciones por aplicativo}, [Power Query]: {transformación de datos escaneados y categorización de componentes}, [Power Apps]: {diseño de aplicaciones para captura y reporte del estado de cumplimiento en el programa regulatorio}",
    "Habilidades": "Estrategia y gobernanza de datos, gestión de proyectos globales, gestión de riesgos regulatorios, soporte a auditorías.",
    "Resultados": "Se alcanzó el cumplimiento total del requerimiento regulatorio en 9 meses: 100% de los componentes fueron remediados o eliminados, reduciendo el riesgo tecnológico y fortaleciendo la postura de cumplimiento ante auditores y reguladores."
  },
  {
    "Año": 2024,
    "Proyecto": "Cumplimiento regulatorio OSFI en productos crediticios (Canadá)",
    "Contexto Caso de Uso": "El regulador canadiense (OSFI) introdujo cambios legales para ajustar los topes de los productos hipotecarios. Para cumplir con este marco, se lanzó un proyecto a nivel bancario que abarcó aproximadamente 30 aplicativos y 200 colaboradores tanto de tecnologia como de negocio (front). El proyecto, con un presupuesto de 5 millones CAD, consistió en identificar los sistemas afectados, ajustar tasas y topes, realizar pruebas en ambientes controlados (UAT, QA) y asegurar el cumplimiento. Como Project Manager Union, se lideró el control financiero, validación de hitos, pagos, contratos, y aseguramiento del cumplimiento operativo y presupuestal.",
    "Problema": "La necesidad de actualizar parámetros legales en productos críticos requería ajustes tecnológicos transversales. No existía una trazabilidad clara sobre el impacto aplicativo ni un modelo consolidado de control financiero, lo que ponía en riesgo el cumplimiento en tiempo y forma.",
    "Herramientas": "[Power BI]: {visualización de la salud financiera del proyecto y de la dedicación del equipo}, [Excel]: {consolidación financiera de contratos, costos y control de horas}, [Power Query]: {extracción y limpieza de datos financieros de múltiples fuentes}, [Power Pivot con DAX]: {modelado de datos financieros y creación de reportes personalizados}, [JPPM]: {gestión de tiempos y carga de empleados}, [Templates/Project Charters]: {estructuración y formalización del alcance, presupuesto y gobernanza del proyecto}",
    "Habilidades": "Gestión de proyectos tecnológicos, gestión financiera y contractual, control presupuestal, seguimiento de testeo funcional y cumplimiento regulatorio, gestión de riesgos y auditoría.",
    "Resultados": "Proyecto entregado en 8 meses sin ampliaciones ni desviaciones mayores. Variación presupuestal <5%, cumplimiento del 100% de lo solicitado por el regulador, con control financiero mensual y visibilidad ejecutiva en tiempo real."
  },
  {
    "Año": 2023,
    "Proyecto": "Portafolio de automatización y reportería en Recursos Humanos globales",
    "Contexto Caso de Uso": "La necesidad de escalar la eficiencia de operaciones globales de Recursos Humanos impulsó la creación de un portafolio de soluciones tecnológicas. Todo comenzó con un RPA en la nube que realizaba triage de casos mediante 75 reglas definidas, permitiendo redireccionar solicitudes automáticamente a los equipos adecuados. El éxito inicial motivó la creación de nuevos robots que validaban datos, aseguraban completitud y permitían operar sin reprocesos. Se añadió un robot especializado en extracción y reporte en tiempo real para todas las regiones. Esto estructuró la base para una nueva visión data-driven de la operación.",
    "Problema": "El volumen y complejidad de los casos atendidos por RH a nivel global generaba sobrecarga operativa, reprocesos y poca visibilidad ejecutiva. Se necesitaba estandarizar decisiones, reducir tiempos de respuesta y generar insights accionables a partir de la operación para guiar decisiones estratégicas.",
    "Herramientas": "[Pega RPA]: {automatización de triage, validación de casos y actualización de bases operativas}, [Power BI]: {visualización en tiempo real de KPIs y performance global}, [Power Query]: {extracción periódica de logs y métricas}, [Power Pivot con DAX]: {modelado de datos y reportería de valor}, [Excel]: {estructuración de plantillas y control de carga operativa}, [Scrum]: {gestión ágil del portafolio de robots como PO y SM}, [Modelos financieros]: {estimaciones de ahorro operativo y eficiencia por robot}",
    "Habilidades": "Gestión de producto y proyectos, automatización (RPA), reportería avanzada, gestión de stakeholders globales, gobierno de datos, eficiencia operativa.",
    "Resultados": "Reducción estimada de entre 10 y 15 FTEs en cargas operativas, reportería ejecutiva en tiempo real, insights sobre calidad y eficiencia operativa, escalabilidad futura hacia proyectos con inteligencia artificial."
  },
  {
    "Año": 2023,
    "Proyecto": "Sistema de validación automatizada para Contact Centers del Caribe",
    "Contexto Caso de Uso": "En respuesta a niveles críticos de fraude y suplantación en los contact centers de Colombia, Panamá y Costa Rica, se desarrolló un sistema robótico de escritorio que fortalecía los protocolos de autenticación del cliente en tiempo real. El sistema se activaba automáticamente al inicio de cada llamada, generando preguntas aleatorias basadas en criterios de riesgo, y validaba las respuestas del cliente antes de permitir cualquier operación. El robot alertaba cuando la autenticación fallaba y generaba logs estructurados para auditoría. Fue instalado en más de 120 estaciones, operando en modalidad 24/7.",
    "Problema": "Las operaciones de atención telefónica no contaban con filtros robustos ni preguntas estructuradas para validar la identidad del cliente. Esto permitía que terceros no autorizados realizaran modificaciones sensibles, exponiendo al banco a fraudes y sanciones regulatorias.",
    "Herramientas": "[Pega RPA]: {desarrollo e implementación del robot de autenticación en escritorio}, [Excel]: {reportería de logs y eventos de autenticación para análisis operativo}, [Marco de riesgos]: {construcción de criterios de aleatorización y niveles de riesgo para filtros}, [Scrum]: {gestión ágil del desarrollo con backlog, historias de usuario y sesiones de refinamiento}, [Artefactos de PO]: {liderazgo del producto, visión de usuario, validación de releases y criterios de aceptación}",
    "Habilidades": "Gestión de producto y proyectos, automatización (RPA), gobierno de datos operativos, ciberseguridad operativa, gestión de stakeholders multiculturales, análisis de riesgo operativo.",
    "Resultados": "Instalación y operación estable en más de 120 estaciones, reducción significativa de eventos de suplantación, mitigación del riesgo reputacional y financiero, creación de trazabilidad para auditorías y toma de decisiones de seguridad."
  },
  {
    "Año": 2024,
    "Proyecto": "Sistema algorítmico para análisis de criptoactivos",
    "Contexto Caso de Uso": "Como aficionado a las inversiones y trader activo, detecté que los indicadores técnicos de los exchanges eran utilizados por millones de usuarios simultáneamente, generando efectos rezagados y aumentando la volatilidad. Para mejorar la velocidad y precisión en la toma de decisiones, desarrollé un sistema algorítmico en Python que se conecta con la API de Binance y analiza múltiples periodos de tiempo para anticipar la dirección de los precios.",
    "Problema": "La dependencia de indicadores técnicos comunes disponibles en los exchanges generaba comportamientos predecibles en el mercado y retrasos en la lectura real de tendencias, dificultando la toma de decisiones ágiles y diferenciadas.",
    "Herramientas": "[Python]: {extracción de datos y cálculos algorítmicos sobre múltiples periodos de tiempo}, [API Binance]: {acceso en tiempo real a datos de mercado para múltiples criptomonedas}, [Power BI]: {visualización de resultados e insights adicionales}, [Modelos financieros]: {estructuración de variables de tendencia, riesgo y volatilidad}, [CRISP-DM]: {estructura metodológica para análisis de datos e iteración del modelo}",
    "Habilidades": "Análisis técnico y fundamental, programación en Python, automatización de indicadores, diseño de modelos de decisión, visualización de datos, uso de APIs, metodologías de análisis de datos.",
    "Resultados": "Sistema funcional con tiempo de respuesta de 2-3 segundos por activo y periodo, permitiendo identificar si un activo mantiene o cambia su tendencia. Aceleró significativamente mi toma de decisiones con lógica personalizada e indicadores propios no disponibles en exchanges."
  },
  {
    "Año": 2021,
    "Proyecto": "Transformación digital de un restaurante tradicional",
    "Contexto Caso de Uso": "Al adquirir un restaurante de comida tradicional colombiana en Bogotá, identifiqué una desconexión entre la operación diaria y el acceso a información clave para tomar decisiones, especialmente al no poder estar presente todo el tiempo. Dado que el equipo tenía una baja alfabetización digital, diseñé una solución adaptada a su realidad cultural y operativa: un sistema de registro sencillo mediante planillas manuales que luego eran digitalizadas. Esta información fue estructurada, cargada en bases relacionales y visualizada mediante dashboards, lo que permitió monitorear el negocio a diario sin necesidad de grandes inversiones en tecnología o cambios drásticos en los procesos.",
    "Problema": "La ausencia de digitalización y la baja literacia tecnológica del equipo impedían tener visibilidad sobre costos, ingresos e insumos en tiempo real, lo que dificultaba la toma de decisiones estratégicas y operativas para un negocio que dependía del flujo diario de caja y rotación de productos.",
    "Herramientas": "[Mensajería instantánea]: {recolección de datos operativos diarios de manera práctica y accesible}, [Excel]: {consolidación de planillas y procesamiento preliminar de datos}, [SQLite]: {almacenamiento local de datos estructurados}, [Power Query]: {extracción y transformación de datos desde múltiples fuentes}, [Power Pivot]: {modelado de relaciones entre recetas, costos, ventas e insumos}, [Power BI (Desktop y Mobile)]: {visualización diaria de ingresos, costos, platos vendidos y eficiencia operativa}",
    "Habilidades": "Analítica aplicada a negocio tradicional, modelado de datos, visualización operativa, transformación digital adaptada a cultura organizacional, diseño centrado en el usuario, eficiencia operativa sin infraestructura tecnológica costosa.",
    "Resultados": "Visibilidad diaria (con desfase de un día) de ingresos, egresos, y costos por plato e insumo. Creación de un recetario digital con ~140 recetas y 2.800 registros de insumos. Optimización en compras, personal y costos, y toma de decisiones basada en datos."
  },
  {
    "Año": 2025,
    "Proyecto": "Calculadora de transformación digital",
    "Contexto Caso de Uso": "Tras culminar una doble maestría en transformación digital y negocios digitales, decidí consolidar mi conocimiento desarrollando una herramienta gratuita para diagnosticar el estado de madurez digital de las empresas. El objetivo era ofrecer valor al mercado y, al mismo tiempo, construir una base de datos útil para benchmarking y toma de decisiones. Diseñé y programé completamente in-house una calculadora que, a partir de un formulario web, recibe inputs de usuarios, calcula scores de madurez por capacidad, genera un reporte personalizado y lo entrega automáticamente vía correo.",
    "Problema": "No existía una herramienta accesible, gratuita y automatizada que permitiera diagnosticar capacidades digitales de forma rápida, confiable y accionable. Las plataformas existentes eran fragmentadas o demasiado genéricas, dificultando el uso personalizado o el aprovechamiento posterior de los datos.",
    "Herramientas": "[HTML/CSS]: {estructura y diseño del formulario web en GitHub Pages}, [FastAPI]: {gestión del backend para captura, ejecución y generación de reportes}, [Python]: {automatización de cálculo de scores, generación de gráficas y consolidación de reportes}, [SQLite]: {base de datos local para almacenar inputs y resultados}, [Google Cloud]: {alojamiento seguro de scripts y ficheros de modelos}, [GitHub Pages]: {hosting gratuito del frontend con conexión al backend}, [Certificados SSL]: {seguridad de dominios y confidencialidad de datos}",
    "Habilidades": "Desarrollo web fullstack, diseño de producto digital, ingeniería de datos, automatización, análisis de capacidades organizacionales, estructuración de cuestionarios, visualización y entrega de valor digital.",
    "Resultados": "Herramienta completamente funcional que evalúa 6 capacidades clave dentro de la mega capacidad de gestión de datos digitales. Generación automática de reportes con estado actual, quick wins, rutas de mejora, métricas clave y oportunidades. Base de conocimiento reutilizable para análisis de benchmarking y necesidades de mercado."
  },
  {
    "Año": 2025,
    "Proyecto": "Robot de trading algorítmico para criptoactivos",
    "Contexto Caso de Uso": "Este proyecto nació como una evolución del sistema de análisis de criptoactivos anterior. El objetivo fue escalar la lógica de indicadores técnicos personalizados hacia un algoritmo autónomo que, mediante múltiples modelos predictivos, fuera capaz de tomar decisiones de compra, venta o mantenimiento, con posibilidad futura de ejecución automática vía API. El robot procesa datos históricos y en tiempo real, calcula más de 60 variables, evalúa la precisión de los modelos y ejecuta un backtesting para validar su rentabilidad antes de pasar a operaciones reales.",
    "Problema": "Las decisiones de inversión basadas en análisis técnico tradicional son lentas, manuales y propensas a errores humanos, especialmente en mercados volátiles como el de criptoactivos. No existía un sistema personalizado que combinara velocidad, precisión y automatización con lógica ajustada al estilo de trading (scalping, holding, etc.).",
    "Herramientas": "[Python]: {desarrollo del sistema completo de análisis y automatización}, [SQLite]: {almacenamiento estructurado de históricos y cálculos por intervalos}, [API Binance]: {extracción de datos de mercado y posterior automatización de operaciones}, [Pandas & DataFrames]: {modelado y transformación de datos}, [Scikit-learn & XGBoost]: {creación de modelos predictivos}, [Matrices de confusión]: {validación de precisión y exactitud}, [Backtesting]: {validación de rentabilidad sobre el histórico}, [Cloud (planificada)]: {ejecución 24/7 en VM como Google Cloud}, [APIs de Reddit (futuro)]: {extracción de señales para análisis fundamental de sentimiento}",
    "Habilidades": "Ingeniería de datos, modelado predictivo, desarrollo de algoritmos, scalping de futuros, validación de modelos, automatización, análisis técnico y preparación para integración de análisis fundamental (sentimiento, influencers, emociones).",
    "Resultados": "MVP funcional con más de 60 variables, +15 indicadores personalizados, procesamiento de millones de registros por intervalo. Algoritmo estructurado con doble validación (precisión y rentabilidad). Próximos pasos: despliegue en la nube, integración con fuentes de análisis fundamental y creación de estrategias múltiples para portafolio automatizado."
  },
  {
    "Año": 2018,
    "Proyecto": "Réplica del modelo de riesgo de un banco",
    "Contexto Caso de Uso": "Durante mis primeros meses en el área de cumplimiento de activos en Scotiabank, aproveché el tiempo libre generado por reformas internas para explorar a fondo los modelos de riesgo utilizados para clasificar clientes. Fascinado por la lógica detrás de la segmentación según variables como tipo de producto, geografía o comportamiento bancario, decidí construir una réplica básica de ese modelo. Lo desarrollé desde cero en Excel, diseñando una calculadora de riesgo que asignaba puntajes según criterios clave, lo que me permitió profundizar en la lógica institucional mientras aumentaba la eficiencia en mis análisis.",
    "Problema": "El análisis de cumplimiento de clientes requería revisar manualmente información dispersa y aplicar múltiples criterios de riesgo. Esta labor consumía tiempo, era propensa a errores y dificultaba la trazabilidad y consistencia en los análisis. No existía una herramienta personal que sistematizara esa lógica ni ofreciera soporte automatizado.",
    "Herramientas": "[Excel]: {desarrollo completo de la calculadora de riesgo mediante fórmulas personalizadas}, [Lógica de negocio]: {implementación de criterios de riesgo cliente, producto, geográfico y mercado en modelo tabulado}, [Automatización simple]: {formulación y tabulación de scripts condicionales en función del puntaje de riesgo}",
    "Habilidades": "Análisis de riesgo, diseño de modelos simplificados, automatización con Excel, interpretación de políticas de cumplimiento, pensamiento estructurado, exploración autodidacta en modelos regulatorios.",
    "Resultados": "Prototipo funcional con 10 variables clave, permitiendo análisis más rápidos, sistemáticos y trazables. La herramienta sirvió como base de aprendizaje sobre scoring de riesgo, automatización básica y lógica detrás del modelo institucional."
  },
  {
    "Año": 2025,
    "Proyecto": "Framework de liderazgo y descomposición del propósito personal de personas y equipos",
    "Contexto Caso de Uso": "En un momento de redefinición personal y profesional —durante mentorías a empresas y mientras cursaba un máster en transformación digital— diseñé un framework para ayudar a personas y líderes a descomponer su propósito personal y conectar sus motivaciones individuales con objetivos grupales y empresariales. La metodología se estructuró a partir de la combinación de herramientas como Ikigai, capitales de Bourdieu, la Rueda de la Vida y acciones SMART, acompañadas de sistemas de gestión visual como Kanban o Scrum, permitiendo generar foco, claridad y planes accionables.",
    "Problema": "Personas y equipos suelen operar sin una conexión explícita entre lo que valoran individualmente y lo que ejecutan en su trabajo diario. Esto genera baja motivación, entregables deficientes y desgaste personal. No existía una herramienta estructurada que facilitara identificar y alinear propósito personal con propósito organizacional.",
    "Herramientas": "[Ikigai personalizado]: {identificación de motivaciones profundas mediante categorización y reflexiones}, [Capitales de Bourdieu]: {clasificación y cuantificación de prioridades vitales}, [Rueda de la Vida]: {visualización de balance actual y metas futuras en 3, 6 y 12 meses}, [SMART Goals]: {definición de objetivos accionables por periodo}, [Herramientas de gestión]: {seguimiento de acciones con Trello, ClickUp, Miro, Planner, Excel u otros}, [Metodologías de productividad]: {implementación de Kanban, Scrum o 4D de la disciplina}",
    "Habilidades": "Autoconocimiento, liderazgo centrado en propósito, coaching personal y de equipos, productividad personal, diseño de sistemas de mejora continua, integración entre metas personales y organizacionales.",
    "Resultados": "Mejora del 200% en velocidad y calidad de entregables en equipos aplicando el framework. Reducción del burnout, mayor claridad estratégica individual, generación de tiempo disponible sin sacrificar resultados. Uso continuo del framework a nivel personal, permitiendo una ejecución extraordinaria y balanceada en múltiples dimensiones de vida."
  },
  {
    "Año": 2024,
    "Proyecto": "Transformación digital de una agencia de marketing digital",
    "Contexto Caso de Uso": "Este proyecto surgió como trabajo de grado de mi doble maestría en liderazgo en transformación digital y negocios digitales. Se ejecutó con una agencia colombiana de marketing digital que, a pesar de su enfoque comercial digital, operaba sin una base tecnológica robusta. Identificamos el riesgo competitivo ante la rápida adopción de IA y automatización por parte de freelancers o soluciones tecnológicas ágiles, y diseñamos un plan de transformación estructurado en tres fases (fundamento cultural, digitalización operativa, y analítica avanzada). Se implementó un MVP de la fase uno con una interfaz llamada ModelView, digitalizando procesos clave, integrando datos estructurados y conectándolos con un LLM como asistente operacional.",
    "Problema": "Las agencias de marketing digital están en riesgo de obsolescencia si no incorporan tecnología real en sus procesos internos. Esta empresa no contaba con infraestructura digital, ni gobierno de datos, ni automatización, lo que la hacía vulnerable ante soluciones ágiles, más rápidas y escalables.",
    "Herramientas": "[Excel y BPM Tools]: {levantamiento y análisis de procesos operativos}, [Figma y Design Thinking]: {prototipado y redefinición de experiencia de cliente}, [Power BI y SQL]: {conexión de datos estructurados y semiestructurados}, [Firebase Studio]: {gestión de bases de datos no relacionales de clientes y procesos}, [Analítica descriptiva y de cliente]: {visualización de patrones, comportamiento y tiempos de operación}, [Scrum + Predictivo]: {ejecución híbrida por fases e iteraciones}, [LLM (nube)]: {implementación de asistente digital interno para consultas de marca, clientes y procesos}, [Interfaz ModelView]: {visualización integrada de procesos y documentos}",
    "Habilidades": "Diseño estratégico de transformación, ejecución de MVP, análisis de procesos, adopción de IA aplicada a operaciones, arquitectura digital, gobernanza de datos, integración de LLMs, metodologías ágiles e híbridas.",
    "Resultados": "Implementación exitosa del MVP de la fase uno. Digitalización de procesos clave, interfaz conectada a datos y LLM operativo. Capacidad de escalar procesos, reducción estimada del 30% en tiempos de ejecución y mayor preparación cultural y técnica para fases avanzadas de automatización y servicios inteligentes."
  },
  {
    "Año": 2023,
    "Proyecto": "Orquestador de Robótica de Procesos para Operaciones de Gestión de Accesos Lógicos en la Banca",
    "Contexto Caso de Uso": "Como respuesta a un requerimiento de auditoría en el área de gestión de accesos lógicos de una entidad bancaria con más de 6.000 empleados, se diseñó e implementó un orquestador de procesos de robótica. Este actuaba como un marco centralizado de gobernanza para automatizar las operaciones de acceso en más de 25 líneas operativas. El proyecto inició con la operación de Contact Center en Canadá, se levantaron procesos de ~10 aplicativos y se diseñó un flujo de datos y procesos estandarizado. Posteriormente se escalaron las automatizaciones a áreas como Collections, Finanzas y AML, usando una metodología híbrida (predictiva para planificación y Scrum para ejecución técnica).",
    "Problema": "La gestión de accesos era manual, fragmentada y con baja trazabilidad, lo que generaba brechas en cumplimiento, riesgos operativos y demoras excesivas. La alta dependencia de procesos manuales impedía tener visibilidad, velocidad y control sobre las altas, bajas y modificaciones de usuarios.",
    "Herramientas": "[Excel]: {estructuración y trazabilidad inicial de accesos}, [Herramientas BPMN]: {diagramación y levantamiento de procesos por operación}, [Power BI]: {seguimiento visual y reporting del estado de automatización}, [Bases de datos estructuradas]: {almacenamiento de flujos de accesos por operación}, [Scrum + Predictivo]: {planificación por portafolio, ejecución ágil por automatización}, [Estrategia de datos y procesos]: {alineación de inputs/outputs operativos para alimentar la robótica}",
    "Habilidades": "Orquestación de RPA, diseño de portafolios escalables de automatización, cumplimiento regulatorio, transformación operativa, gestión de operaciones bancarias, liderazgo transversal en procesos y datos.",
    "Resultados": "Reducción del tiempo de alta de nuevos usuarios de 35 días a 2 semanas (primer MVP) con proyección a 1 semana. Liberación de ~2 FTEs por operación mediante automatización. Homologación de procesos y trazabilidad completa de accesos. Expansión del modelo a áreas de AML, Finanzas y Collections como parte del roadmap de automatización."
  },
  {
    "Año": 2023,
    "Proyecto": "Automatización robótica del proceso exógeno para equipo de impuestos en banca",
    "Contexto Caso de Uso": "En una empresa bancaria de aproximadamente 5.000 empleados, el equipo de impuestos debía diligenciar de manera manual y periódica los reportes de exógena requeridos por entidades oficiales. Esta actividad, repetitiva y con picos altos de carga al cierre del año fiscal, consumía tiempo valioso de los analistas. Se diseñó e implementó un robot RDA (Robotic Desktop Application) que automatizaba el proceso a partir de los inputs entregados por los analistas. La ejecución era activada por el usuario, y el robot realizaba las operaciones necesarias con mínima intervención posterior.",
    "Problema": "La carga operativa del proceso exógeno limitaba la eficiencia del equipo de impuestos. La manualidad, sumada al carácter cíclico y regulado del proceso, lo hacía propenso a errores, retrabajo y dependencia del conocimiento tácito. Se requería mayor estandarización, velocidad y cumplimiento regulatorio mediante automatización.",
    "Herramientas": "[RDA (Robotic Desktop Automation)]: {automatización del diligenciamiento exógeno con activación manual}, [Excel]: {fuente de datos e inputs para los robots}, [Scrum]: {gestión ágil de la automatización}, [PO Tools]: {definición de user stories y validación de entregables}, [Documentación técnica]: {recolección de queries y lógica de consolidación}",
    "Habilidades": "Robótica de escritorio, optimización operativa, documentación de procesos, liderazgo ágil, diseño de soluciones reguladas, interacción humano-robot.",
    "Resultados": "Liberación del 15% de la capacidad del equipo de impuestos, reducción de errores manuales y cumplimiento de requerimientos de automatización. Aumento de trazabilidad del proceso, con ejecución recurrente en ciclos mensuales y consolidación automatizada a fin de año."
  },
  {
    "Año": 2022,
    "Proyecto": "Automatización robótica del proceso exógeno para equipo de impuestos en banca",
    "Contexto Caso de Uso": "En una empresa bancaria de aproximadamente 5.000 empleados, el equipo de impuestos debía diligenciar de manera manual y periódica los reportes de exógena requeridos por entidades oficiales. Esta actividad, repetitiva y con picos altos de carga al cierre del año fiscal, consumía tiempo valioso de los analistas. Se diseñó e implementó un robot RDA (Robotic Desktop Application) que automatizaba el proceso a partir de los inputs entregados por los analistas. La ejecución era activada por el usuario, y el robot realizaba las operaciones necesarias con mínima intervención posterior.",
    "Problema": "La carga operativa del proceso exógeno limitaba la eficiencia del equipo de impuestos. La manualidad, sumada al carácter cíclico y regulado del proceso, lo hacía propenso a errores, retrabajo y dependencia del conocimiento tácito. Se requería mayor estandarización, velocidad y cumplimiento regulatorio mediante automatización.",
    "Herramientas": "[RDA (Robotic Desktop Automation)]: {automatización del diligenciamiento exógeno con activación manual}, [Excel]: {fuente de datos e inputs para los robots}, [Scrum]: {gestión ágil de la automatización}, [PO Tools]: {definición de user stories y validación de entregables}, [Documentación técnica]: {recolección de queries y lógica de consolidación}",
    "Habilidades": "Robótica de escritorio, optimización operativa, documentación de procesos, liderazgo ágil, diseño de soluciones reguladas, interacción humano-robot.",
    "Resultados": "Liberación del 15% de la capacidad del equipo de impuestos, reducción de errores manuales y cumplimiento de requerimientos de automatización. Aumento de trazabilidad del proceso, con ejecución recurrente en ciclos mensuales y consolidación automatizada a fin de año."
  },
  {
    "Año": 2021,
    "Proyecto": "Automatización robótica post-llamada para asesores de Collections",
    "Contexto Caso de Uso": "En un entorno de operaciones con aproximadamente 50 asesores de Collections distribuidos en varios países del Caribe, se identificó una oportunidad para automatizar las tareas posteriores a cada llamada. El proceso manual de ingreso de datos al sistema carecía de estructura y generaba pérdida de información clave para la trazabilidad del cliente. Se diseñó e implementó una solución de automatización de escritorio (RDA) que se activaba automáticamente al finalizar cada llamada, guiando al asesor en la recolección de datos estandarizados y complementándolos con información del sistema del cliente.",
    "Problema": "La recolección de datos post-llamada era inconsistente y dependiente del criterio individual del asesor. Esto afectaba la experiencia del cliente, la trazabilidad operativa y la capacidad de análisis posterior. Además, aumentaba la carga operativa sin agregar valor directo.",
    "Herramientas": "[RDA (Robotic Desktop Automation)]: {automatización activa del proceso post-llamada}, [Scrum]: {gestión iterativa del desarrollo y despliegue}, [PO Tools]: {definición de requerimientos y refinamiento de historias de usuario}, [Bases de datos]: {almacenamiento estructurado de los logs y atributos del cliente}, [Documentación colaborativa]: {levantamiento y estandarización del flujo de atención post-llamada}",
    "Habilidades": "Automatización colaborativa humano-robot, diseño de procesos post-interacción, análisis de experiencia de cliente, gestión de operaciones remotas, integración de datos cliente-operación, liderazgo en proyectos de escala regional.",
    "Resultados": "Liberación del 7% de la capacidad operativa por asesor, consolidación estructurada de miles de interacciones diarias, estandarización de los registros post-llamada en múltiples países del Caribe, y mejora en la trazabilidad y análisis de experiencia del cliente."
  }
]